# Day one basic

In [1]:
import pandas as pd

In [4]:
s=pd.Series([10,20,30])
s1=pd.Series([10,20,23],index=['a','b','c'])
print(s)
print(s1)

0    10
1    20
2    30
dtype: int64
a    10
b    20
c    23
dtype: int64

In [7]:
print(s1['a'])
print(s[2])

10
30

In [11]:
print(s+10)
print(s*2)
print(s.mean())
print(s.max())

0    20
1    30
2    40
dtype: int64
0    20
1    40
2    60
dtype: int64
20.0
30

# day 2 data frame

In [16]:
data={
    'name':['karan','bhoomi'],
    'age':[21,22],
    'city':['kangra','delhi']
}
df=pd.DataFrame(data,index=['a','b'])
print(df)

     name  age    city
a   karan   21  kangra
b  bhoomi   22   delhi

In [20]:
print(df['name'])
print(df[['name','age']])

a     karan
b    bhoomi
Name: name, dtype: object
     name  age
a   karan   21
b  bhoomi   22
name     karan
age         21
city    kangra
Name: a, dtype: object
delhi

In [22]:
print(df.loc['a'])

name     karan
age         21
city    kangra
Name: a, dtype: object

print(df.iloc[1])

In [29]:
print(df.shape)
print(df.columns)
print(df.dtypes)
print(df.info)
print(df.describe)

(2, 3)
Index(['name', 'age', 'city'], dtype='object')
name    object
age      int64
city    object
dtype: object
<bound method DataFrame.info of      name  age    city
a   karan   21  kangra
b  bhoomi   22   delhi>
<bound method NDFrame.describe of      name  age    city
a   karan   21  kangra
b  bhoomi   22   delhi>

# day 3 filter

In [32]:
print(df[df['age']>21])
print(df[(df['age']>20) & (df['city']=='delhi')])

     name  age   city
b  bhoomi   22  delhi
     name  age   city
b  bhoomi   22  delhi

In [33]:
print(df[df['city'].isin(['delhi','haryana'])])

     name  age   city
b  bhoomi   22  delhi

In [34]:
print(df[df['age'].between(20,30) ])

     name  age    city
a   karan   21  kangra
b  bhoomi   22   delhi

# modifying data

In [36]:
df['marks']=[80,90]
print(df)

     name  age    city  marks
a   karan   21  kangra     80
b  bhoomi   22   delhi     90

In [37]:
df.drop('marks',axis=1)

     name  age    city
a   karan   21  kangra
b  bhoomi   22   delhi

In [38]:
df.rename(columns={'name':'student'})

  student  age    city  marks
a   karan   21  kangra     80
b  bhoomi   22   delhi     90

In [42]:
df['city']=df['city'].replace('delhi','bhatrala')
print(df)

     name  age      city  marks
a   karan   21    kangra     80
b  bhoomi   22  bhatrala     90

# day 5

In [43]:
import pandas as pd
import numpy as np

data = {
    'Name': ['Karan', 'Riya', 'Pinku', 'Aman'],
    'Age': [21, np.nan, 20, 23],
    'Marks': [88, 76, np.nan, np.nan],
    'City': ['Kangra', 'Delhi', np.nan, 'Delhi']
}

df = pd.DataFrame(data)
print(df)

    Name   Age  Marks    City
0  Karan  21.0   88.0  Kangra
1   Riya   NaN   76.0   Delhi
2  Pinku  20.0    NaN     NaN
3   Aman  23.0    NaN   Delhi

In [44]:
print(df.isnull())

    Name    Age  Marks   City
0  False  False  False  False
1  False   True  False  False
2  False  False   True   True
3  False  False   True  False

In [45]:
print(df.isnull().sum())

Name     0
Age      1
Marks    2
City     1
dtype: int64

In [51]:
print(df.dropna())
print(df.dropna(how='all'))

    Name   Age  Marks    City
0  Karan  21.0   88.0  Kangra
3   Aman  23.0    1.0   Delhi
    Name   Age  Marks    City
0  Karan  21.0   88.0  Kangra
1   Riya   NaN   76.0   Delhi
2  Pinku  20.0    1.0     NaN
3   Aman  23.0    1.0   Delhi

In [47]:
print(df.fillna(0))

    Name   Age  Marks    City
0  Karan  21.0   88.0  Kangra
1   Riya   0.0   76.0   Delhi
2  Pinku  20.0    0.0       0
3   Aman  23.0    0.0   Delhi

In [50]:
df['Marks']=df['Marks'].fillna(1)
print(df)

    Name   Age  Marks    City
0  Karan  21.0   88.0  Kangra
1   Riya   NaN   76.0   Delhi
2  Pinku  20.0    1.0     NaN
3   Aman  23.0    1.0   Delhi

In [52]:
import pandas as pd
import numpy as np

data = {
    'Name': ['Karan', 'Riya', 'Pinku', 'Aman'],
    'Age': [21, np.nan, 20, 23],
    'Marks': [88, 76, np.nan, np.nan],
    'City': ['Kangra', 'Delhi', np.nan, 'Delhi']
}

df = pd.DataFrame(data)
print(df)

    Name   Age  Marks    City
0  Karan  21.0   88.0  Kangra
1   Riya   NaN   76.0   Delhi
2  Pinku  20.0    NaN     NaN
3   Aman  23.0    NaN   Delhi

In [54]:
print("\nMissing value")
print(df.isnull())
print("\nMissing value count")
print(df.isnull().sum())

Missing value
    Name    Age  Marks   City
0  False  False  False  False
1  False   True  False  False
2  False  False   True   True
3  False  False   True  False

Missing value count
Name     0
Age      1
Marks    2
City     1
dtype: int64

In [55]:
print(df.dropna())

    Name   Age  Marks    City
0  Karan  21.0   88.0  Kangra

In [57]:
print(df.fillna(1))

    Name   Age  Marks    City
0  Karan  21.0   88.0  Kangra
1   Riya   1.0   76.0   Delhi
2  Pinku  20.0    1.0       1
3   Aman  23.0    1.0   Delhi

In [60]:
df['Marks']=df['Marks'].fillna('fail')
print(df)
print(df['Marks'])

    Name   Age Marks    City
0  Karan  21.0  88.0  Kangra
1   Riya   NaN  76.0   Delhi
2  Pinku  20.0  fail     NaN
3   Aman  23.0  fail   Delhi
0    88.0
1    76.0
2    fail
3    fail
Name: Marks, dtype: object

In [61]:
import pandas as pd

data = {
    'Student': ['Karan', 'Riya', 'Pinku', 'Aman', 'Diya', 'Vivek'],
    'Class': ['10A', '10A', '10B', '10B', '10A', '10B'],
    'Marks': [88, 76, 90, 65, 84, 78]
}

df = pd.DataFrame(data)
print(df)

  Student Class  Marks
0   Karan   10A     88
1    Riya   10A     76
2   Pinku   10B     90
3    Aman   10B     65
4    Diya   10A     84
5   Vivek   10B     78

In [62]:
grouped = df.groupby('Class')['Marks'].mean()
print(grouped)

Class
10A    82.666667
10B    77.666667
Name: Marks, dtype: float64

In [63]:
# Sum
print(df.groupby('Class')['Marks'].sum())

# Count
print(df.groupby('Class')['Marks'].count())

# Max/Min
print(df.groupby('Class')['Marks'].max())

Class
10A    248
10B    233
Name: Marks, dtype: int64
Class
10A    3
10B    3
Name: Marks, dtype: int64
Class
10A    88
10B    90
Name: Marks, dtype: int64

In [64]:
import pandas as pd

df1 = pd.DataFrame({
    'Name': ['Karan', 'Riya'],
    'Marks': [88, 76]
})

df2 = pd.DataFrame({
    'Name': ['Pinku', 'Aman'],
    'Marks': [90, 65]
})

df_combined = pd.concat([df1, df2])
print(df_combined)

    Name  Marks
0  Karan     88
1   Riya     76
0  Pinku     90
1   Aman     65

In [65]:
df_a = pd.DataFrame({'A': [1, 2]})
df_b = pd.DataFrame({'B': [3, 4]})

df_side = pd.concat([df_a, df_b], axis=1)
print(df_side)

   A  B
0  1  3
1  2  4

In [68]:
students = pd.DataFrame({
    'ID': [1, 2, 3],
    'Name': ['Karan', 'Riya', 'Pinku']
})

marks = pd.DataFrame({
    'ID': [1, 2, 4],
    'Marks': [88, 76, 90]
})

merged = pd.merge(students,marks)
print(merged)

   ID   Name  Marks
0   1  Karan     88
1   2   Riya     76